#name = input("Введіть, будь ласка, ваше ім'я: ")
#print(name)
#print("Вітаємо, " + name)
print("Примітка: кожна наступна операція здійснюється з рядком, який було здобуто в попередній операції.")
x = "Як ваші справи? Усе має бути прекрасно!"
print("Початковий рядок: ", x)
y = x[0:2]
z = x[4:]
x = y + z
print("Після видалення 2-х символів, які починаються з 3-ого: ", x)
x = x[:2] + "abcd" + x[3:]
print("Після вставлення 4-х символів, які починаються з 3-ого: ", x)
x = x.replace("а", "о")
print("Після заміни всіх літер а на літери о: ", x)
x = x[:20]
print("Після взяття і виведення перших 20-ти символів рядка: ", x)
x = x.upper()
print("Після того, як усі літери стали великими", x)
disallowed_character = "О"
for character in disallowed_character:
    x = x.replace(character, "")
print("Після прибрання всіх літер о: ", x)
x = x.find("К")
x = x + 1
print("Перша поява літери К (її номер у рядку): ", x)